app/controllers/products_controller.rb

  def index
    @products = Product.all.limit(20)
---
SELECT `products`.* FROM `products` LIMIT 20

  def search
    @products = Product.where('title LIKE(?)', "%#{params[:keyword]}%")
---
SELECT `products`.* FROM `products` WHERE (title LIKE('%<%= params[:keyword] %>%'))