app/controllers/reviews_controller.rb

  def create
    Review.create(create_params)
---
INSERT INTO `reviews` (`created_at`, `nickname`, `product_id`, `rate`, `review`, `updated_at`) VALUES ('2016-09-08 13:38:28', 'a', 1, 1, 'a', '2016-09-08 13:38:28')